{
  "auto_mapping": null,
  "base_model_name_or_path": "Langboat/bloom-1b4-zh",
  "encoder_hidden_size": 2048,
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 10,
  "peft_type": "PREFIX_TUNING",
  "peft_version": "0.18.0",
  "prefix_projection": true,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 2048
}